### sqlite3 is the default packages in python 2.5+ We will create sqlite database in this short tutorial and will do some basic operation on the table

In [1]:
import sqlite3

In [2]:
#lets create a new database
conn = sqlite3.connect('sqlitedb.db')

In [3]:
cursor = conn.cursor()

In [4]:
cursor.execute('''create table customer(user_id integer primary key not null,
product_id integer not null,
Name text not null,
Gender text not null,
Age integer not null,
City text)''')
conn.commit()

## different ways to add the data into table
To add a single row into the table using insert

In [5]:
cursor.execute('''insert into customer('user_id','product_id','Name', 'Gender', 'Age', 'City') values (111,123,'Harish','Male',28,'Pune');''')

To add multiple rows into the table using insert

In [6]:
cursor.executescript('''insert into customer values (112,234,'Hrishikesh','Male',27,'Thane');
insert into customer values (113,345,'Amir','Male',28,'Solapur');''')

To add multiple rows into the table without repeating insert command

In [7]:
# insert the multiple values into table at once
customers = [(114,345,'Rahul','Male',22,'Delhi'),(115,456,'Priyanka','Female',24,'Mumbai'),(116,765,'Lalita','Female',30,'Bangalore')]
cursor.executemany('insert into customer values (?,?,?,?,?,?)',customers)

# To fetch the values from table

In [8]:
cursor.execute('select * from customer;').fetchone()

(111, 123, 'Harish', 'Male', 28, 'Pune')

In [9]:
for row in cursor.execute('select * from customer;'):
    print(row)

(111, 123, 'Harish', 'Male', 28, 'Pune')
(112, 234, 'Hrishikesh', 'Male', 27, 'Thane')
(113, 345, 'Amir', 'Male', 28, 'Solapur')
(114, 345, 'Rahul', 'Male', 22, 'Delhi')
(115, 456, 'Priyanka', 'Female', 24, 'Mumbai')
(116, 765, 'Lalita', 'Female', 30, 'Bangalore')

In [10]:
#fetch values from one column
for name in cursor.execute('select Name from customer;'):
    print(name)

('Harish',)
('Hrishikesh',)
('Amir',)
('Rahul',)
('Priyanka',)
('Lalita',)

In [11]:
# for all values
cursor.execute('select * from customer;').fetchall()

[(111, 123, 'Harish', 'Male', 28, 'Pune'),
 (112, 234, 'Hrishikesh', 'Male', 27, 'Thane'),
 (113, 345, 'Amir', 'Male', 28, 'Solapur'),
 (114, 345, 'Rahul', 'Male', 22, 'Delhi'),
 (115, 456, 'Priyanka', 'Female', 24, 'Mumbai'),
 (116, 765, 'Lalita', 'Female', 30, 'Bangalore')]

# read data into pandas dataframe

In [12]:
import pandas as pd

In [13]:
df = pd.read_sql_query('select * from customer;',conn)
df

   user_id  product_id        Name  Gender  Age       City
0      111         123      Harish    Male   28       Pune
1      112         234  Hrishikesh    Male   27      Thane
2      113         345        Amir    Male   28    Solapur
3      114         345       Rahul    Male   22      Delhi
4      115         456    Priyanka  Female   24     Mumbai
5      116         765      Lalita  Female   30  Bangalore

In [14]:
df_age28 = pd.read_sql_query('select * from customer where age = 28',conn)
df_age28

   user_id  product_id    Name Gender  Age     City
0      111         123  Harish   Male   28     Pune
1      113         345    Amir   Male   28  Solapur

In [15]:
df_ = pd.read_sql_query('select * from customer group by gender;',conn)
df_

   user_id  product_id      Name  Gender  Age    City
0      115         456  Priyanka  Female   24  Mumbai
1      111         123    Harish    Male   28    Pune

In [17]:
#Having
df_having = pd.read_sql_query('select * from customer group by gender having age > 25;',conn)
df_having

   user_id  product_id    Name Gender  Age  City
0      111         123  Harish   Male   28  Pune

# lets update the values in the tabel

In [18]:
df = pd.read_sql_query('select * from customer;',conn)
df

   user_id  product_id        Name  Gender  Age       City
0      111         123      Harish    Male   28       Pune
1      112         234  Hrishikesh    Male   27      Thane
2      113         345        Amir    Male   28    Solapur
3      114         345       Rahul    Male   22      Delhi
4      115         456    Priyanka  Female   24     Mumbai
5      116         765      Lalita  Female   30  Bangalore

In [19]:
conn.execute('''update customer Set age = age+10 where gender = 'Male';''')

In [20]:
df = pd.read_sql_query('select * from customer;',conn)
df

   user_id  product_id        Name  Gender  Age       City
0      111         123      Harish    Male   38       Pune
1      112         234  Hrishikesh    Male   37      Thane
2      113         345        Amir    Male   38    Solapur
3      114         345       Rahul    Male   32      Delhi
4      115         456    Priyanka  Female   24     Mumbai
5      116         765      Lalita  Female   30  Bangalore

# To delete the entry

In [21]:
conn.execute('''delete from customer where user_id = 111;''')

In [22]:
df = pd.read_sql_query('select * from customer;',conn)
df

   user_id  product_id        Name  Gender  Age       City
0      112         234  Hrishikesh    Male   37      Thane
1      113         345        Amir    Male   38    Solapur
2      114         345       Rahul    Male   32      Delhi
3      115         456    Priyanka  Female   24     Mumbai
4      116         765      Lalita  Female   30  Bangalore

In [24]:
# To Drop the table
conn.execute('''drop table customer''')
conn.execute('''select * from customer''')

OperationalError: no such table: customer

In [25]:
conn.close()